Revit 2024 API
ValueAtPoint Class
 Stores values at one domain point. Each value corresponds to a "measurement" for which this value was calculated.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2011
Syntax
C#
public class ValueAtPoint : ValueAtPointBase
Visual Basic
Public Class ValueAtPoint _
	Inherits ValueAtPointBase
Visual C++
public ref class ValueAtPoint : public ValueAtPointBase
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.ValueAtPointBase
 Autodesk.Revit.DB.Analysis.ValueAtPoint
See Also
ValueAtPoint Members
Autodesk.Revit.DB.Analysis Namespace